Practice5_01/src/Documents/Продажа/Продажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Продажа</name>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Practice5_01/src/Documents/Продажа/Forms/DocumentForm/Module.bsl
&AtClient
Procedure ТоварыЦенаПриИзменении(Item)
	ТекущаяСтрока = Элементы.Товары.CurrentData;
	ПересчитатьСуммуСтрокиИДокумента(ТекущаяСтрока);
EndProcedure
&AtClient
Procedure ТоварыКоличествоПриИзменении(Item)
	ТекущаяСтрока = Элементы.Товары.CurrentData;
	ПересчитатьСуммуСтрокиИДокумента(ТекущаяСтрока);
EndProcedure

&AtClient
Procedure ПересчитатьСуммуСтрокиИДокумента(ТекущаяСтрока)
	
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
		Object.СуммаДокумента = Object.Товары.Total("Сумма"); 
	
EndProcedure
